lab-bill/comp-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 1
    - duration: 3
      arrivalRate: 3
  processor: "./load-test-create-user.js"

scenarios:
  - name: "Register a user"
    flow:
      - function: "create"
      - post:
          url: "/signup"
          afterResponse: "getToken"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            json: "$"
            as: "token"

      - log: "Received {{ token }}"